print("GPA calculator")

print("="*30)

p=float(input("คะแนนวิชาฟิสิกส์: ")) #หน่วยกิต 2.0
c=float(input("คะแนนวิชาเคมี: ")) #หน่วยกิต 1.5
b=float(input("คะแนนวิชาชีวะ: ")) #หน่วยกิต 1.5
m=float(input("คะแนนวิชาคณิตศาสตร์: ")) #หน่วยกิต 1.5
e=float(input("คะแนนวิชาภาษาอังกฤษ: ")) #หน่วยกิต 1.0
t=float(input("คะแนนวิชาภาษาไทย: ")) #หน่วยกิต 1.0
s=float(input("คะแนนวิชาสังคมศึกษา: ")) #หน่วยกิต 1.0

print("="*30)

if(p<0 or p>100):
    print("คะแนนวิชาฟิสิกส์ของคุณไม่ถูกต้อง")
    p2=-999
else:
    if(p>=80):
        p2=4.0*2
        p3=4.0
    elif(p>=75):
        p2=3.5*2
        p3=3.5
    elif(p>=70):
        p2=3.0*2
        p3=3.0
    elif(p>=65):
        p2=2.5*2
        p3=2.5
    elif(p>=60):
        p2=2.0*2
        p3=2.0
    elif(p>=55):
        p2=1.5*2
        p3=1.5
    elif(p>=50):
        p2=1.0*2
        p3=1.0
    else:
        p2=0.0*2
        p3=0
    print("คะแนนวิชาฟิสิกส์ หน่วยกิต 2.0 เกรด", p3)

if(c<0 or c>100):
    print("คะแนนวิชาเคมีของคุณไม่ถูกต้อง")
    c2=-999
else:
    if(c>=80):
        c2=4.0*1.5
        c3=4.0
    elif(c>=75):
        c2=3.5*1.5
        c3=3.5
    elif(c>=70):
        c2=3.0*1.5
        c3=3.0
    elif(c>=65):
        c2=2.5*1.5
        c3=2.5
    elif(c>=60):
        c2=2.0*1.5
        c3=2.0
    elif(c>=55):
        c2=1.5*1.5
        c3=1.5
    elif(c>=50):
        c2=1.0*1.5
        c3=1.0
    else:
        c2=0.0*1.5
        c3=0
    print("คะแนนวิชาเคมี หน่วยกิต 1.5 เกรด", c3)

if(b<0 or b>100):
    print("คะแนนวิชาชีวะของคุณไม่ถูกต้อง")
    b2=-999
else:
    if(b>=80):
        b2=4.0*1.5
        b3=4.0
    elif(b>=75):
        b2=3.5*1.5
        b3=3.5
    elif(b>=70):
        b2=3.0*1.5
        b3=3.0
    elif(b>=65):
        b2=2.5*1.5
        b3=2.5
    elif(b>=60):
        b2=2.0*1.5
        b3=2.0
    elif(b>=55):
        b2=1.5*1.5
        b3=1.5
    elif(b>=50):
        b2=1.0*1.5
        b3=1.0
    else:
        b2=0.0*1.5
        b3=0
    print("คะแนนวิชาชีวะ หน่วยกิต 1.5 เกรด", b3)

if(m<0 or m>100):
    print("คะแนนวิชาคณิตศาสตร์ของคุณไม่ถูกต้อง")
    m2=-999
else:
    if(m>=80):
        m2=4.0*1.5
        m3=4.0
    elif(m>=75):
        m2=3.5*1.5
        m3=3.5
    elif(m>=70):
        m2=3.0*1.5
        m3=3.0
    elif(m>=65):
        m2=2.5*1.5
        m3=2.5
    elif(m>=60):
        m2=2.0*1.5
        m3=2.0
    elif(m>=55):
        m2=1.5*1.5
        m3=1.5
    elif(m>=50):
        m2=1.0*1.5
        m3=1.0
    else:
        m2=0.0*1.5
        m3=0
    print("คะแนนวิชาคณิตศาสตร์ หน่วยกิต 1.5 เกรด", m3)

if(e<0 or e>100):
    print("คะแนนวิชาภาษาอังกฤษของคุณไม่ถูกต้อง")
    e2=-999
else:
    if(e>=80):
        e2=4.0*1.0
        e3=4.0
    elif(e>=75):
        e2=3.5*1.0
        e3=3.5
    elif(e>=70):
        e2=3.0*1.0
        e3=3.0
    elif(e>=65):
        e2=2.5*1.0
        e3=2.5
    elif(e>=60):
        e2=2.0*1.0
        e3=2.0
    elif(e>=55):
        e2=1.5*1.0
        e3=1.5
    elif(e>=50):
        e2=1.0*1.0
        e3=1.0
    else:
        e2=0.0*1.0
        e3=0
    print("คะแนนวิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด", e3)

if(t<0 or t>100):
    print("คะแนนวิชาภาษาไทยของคุณไม่ถูกต้อง")
    t2=-999
else:
    if(t>=80):
        t2=4.0*1.0
        t3=4.0
    elif(t>=75):
        t2=3.5*1.0
        t3=3.5
    elif(t>=70):
        t2=3.0*1.0
        t3=3.0
    elif(t>=65):
        t2=2.5*1.0
        t3=2.5
    elif(t>=60):
        t2=2.0*1.0
        t3=2.0
    elif(t>=55):
        t2=1.5*1.0
        t3=1.5
    elif(t>=50):
        t2=1.0*1.0
        t3=1.0
    else:
        t2=0.0*1.0
        t3=0
    print("คะแนนวิชาภาษาไทย หน่วยกิต 1.0 เกรด", t3)

if(s<0 or s>100):
    print("คะแนนวิชาสังคมศึกษาของคุณไม่ถูกต้อง")
    s2=-999
else:
    if(s>=80):
        s2=4.0*1.0
        s3=4.0
    elif(s>=75):
        s2=3.5*1.0
        s3=3.5
    elif(s>=70):
        s2=3.0*1.0
        s3=3.0
    elif(s>=65):
        s2=2.5*1.0
        s3=2.5
    elif(s>=60):
        s2=2.0*1.0
        s3=2.0
    elif(s>=55):
        s2=1.5*1.0
        s3=1.5
    elif(s>=50):
        s2=1.0*1.0
        s3=1.0
    else:
        s2=0.0*1.0
        s3=0
    print("คะแนนวิชาสังคมศึกษา หน่วยกิต 1.0 เกรด", s3)

print("="*30)

if(p2==-999 or c2==-999 or b2==-999 or m2==-999 or e2==-999 or t2==-999 or s2==-999):
    print("ไม่สามารถคำนวณเกรดได้")
else:
    y=p2+c2+b2+m2+e2+t2+s2
    x=y/9.5
    print("หน่วยกิตรวมคือ 9.5")
    print("เกรดเฉลี่ยของคุณคือ %.2f"%x)
