print("โปรแกรมคำนวณเกรดรายวิชาและเกรดเฉลี่ยโดยภาษา Python")#ชื่อโปรแกรม
print("_______________________________")

p=float(input("คะแนนวิชาฟิสิกส์: "))#ระบุคะแนนแต่ละวิชา
c=float(input("คะแนนวิชาเคมี: "))
b=float(input("คะแนนวิชาชีวะ: "))
m=float(input("คะแนนวิชาคณิตศาสตร์: "))
t=float(input("คะแนนวิชาภาษาไทย: "))
e=float(input("คะแนนวิชาภาษาอังกฤษ: "))
s=float(input("คะแนนวิชาสังคมศึกษา: "))

print("_______________________________")

if(p>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 4.0")
    p2=2.0*4.0
elif(p>=75):
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 3.5")
    p2=2.0*3.5
elif(p>=70):
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 3.0")
    p2=2.0*3.0
elif(p>=65):
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 2.5")
    p2=2.0*2.5
elif(p>=60):
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 2.0")
    p2=2.0*2.0
elif(p>=55):
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 1.5")
    p2=2.0*1.5
elif(p>=50):
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 1.0")
    p2=2.0*1.0
else:
    print("วิชาฟิสิกส์ หน่วยกิต 2.0 เกรด 0")
    p2=0

if(c>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 4.0")
    c2=1.5*4.0
elif(c>=75):
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 3.5")
    c2=1.5*3.5
elif(c>=70):
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 3.0")
    c2=1.5*3.0
elif(c>=65):
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 2.5")
    c2=1.5*2.5
elif(c>=60):
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 2.0")
    c2=1.5*2.0
elif(c>=55):
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 1.5")
    c2=1.5*1.5
elif(c>=50):
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 1.0")
    c2=1.5*1.0
else:
    print("วิชาเคมี หน่วยกิต 1.5 เกรด 0")
    c2=0

if(b>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 4.0")
    b2=1.5*4.0
elif(b>=75):
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 3.5")
    b2=1.5*3.5
elif(b>=70):
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 3.0")
    b2=1.5*3.0
elif(b>=65):
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 2.5")
    b2=1.5*2.5
elif(b>=60):
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 2.0")
    b2=1.5*2.0
elif(b>=55):
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 1.5")
    b2=1.5*1.5
elif(b>=50):
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 1.0")
    b2=1.5*1.0
else:
    print("วิชาชีวะ หน่วยกิต 1.5 เกรด 0")
    b2=0

if(m>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 4.0")
    m2=1.0*4.0
elif(m>=75):
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 3.5")
    m2=1.0*3.5
elif(m>=70):
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 3.0")
    m2=1.0*3.0
elif(m>=65):
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 2.5")
    m2=1.0*2.5
elif(m>=60):
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 2.0")
    m2=1.0*2.0
elif(m>=55):
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 1.5")
    m2=1.0*1.5
elif(m>=50):
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 1.0")
    m2=1.0*1.0
else:
    print("วิชาคณิตศาสตร์ หน่วยกิต 1.0 เกรด 0")
    m2=0

if(t>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 4.0")
    t2=1.0*4.0
elif(t>=75):
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 3.5")
    t2=1.0*3.5
elif(t>=70):
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 3.0")
    t2=1.0*3.0
elif(t>=65):
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 2.5")
    t2=1.0*2.5
elif(t>=60):
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 2.0")
    t2=1.0*2.0
elif(t>=55):
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 1.5")
    t2=1.0*1.5
elif(t>=50):
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 1.0")
    t2=1.0*1.0
else:
    print("วิชาภาษาไทย หน่วยกิต 1.0 เกรด 0")
    t2=0

if(e>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 4.0")
    e2=1.0*4.0
elif(e>=75):
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 3.5")
    e2=1.0*3.5
elif(e>=70):
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 3.0")
    e2=1.0*3.0
elif(e>=65):
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 2.5")
    e2=1.0*2.5
elif(e>=60):
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 2.0")
    e2=1.0*2.0
elif(e>=55):
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 1.5")
    e2=1.0*1.5
elif(e>=50):
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 1.0")
    e2=1.0*1.0
else:
    print("วิชาภาษาอังกฤษ หน่วยกิต 1.0 เกรด 0")
    e2=0

if(s>=80):#คัดแยกเกรดจากคะแนนที่ได้ แสดงเกรดพร้อมนำเกรดคูณหน่วยกิต จากนั้นเก็บข้อมูลไว้ในรูปของตัวแปร
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 4.0")
    s2=1.0*4.0
elif(s>=75):
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 3.5")
    s2=1.0*3.5
elif(s>=70):
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 3.0")
    s2=1.0*3.0
elif(s>=65):
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 2.5")
    s2=1.0*2.5
elif(s>=60):
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 2.0")
    s2=1.0*2.0
elif(s>=55):
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 1.5")
    s2=1.0*1.5
elif(s>=50):
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 1.0")
    s2=1.0*1.0
else:
    print("วิชาสังคมศึกษา หน่วยกิต 1.0 เกรด 0")
    s2=0

y=p2+c2+b2+m2+t2+e2+s2 #นำค่าเกรดคูณหน่วยกิดมาบวกกัน

x=y/9.0#นำค่าที่ได้มาหารหน่วยกิตรวมทั้งหมด (9.0)

print("_______________________________")
print("หน่วยกิตรวมคือ 9.0")
print("เกรดเฉลี่ยคือ %.2f"%x)#แสดงผลลัพธ์
